Revit 2027 API
CompoundStructure.IsVerticallyCompound Property
 Identifies if this CompoundStructure represents a layout that is more complicated than a simple set of parallel layers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsVerticallyCompound { get; }
Public ReadOnly Property IsVerticallyCompound As Boolean
	Get
public:
property bool IsVerticallyCompound {
	bool get ();
}
member IsVerticallyCompound : bool with get
Property Value
Boolean
Remarks
 Vertically compound structures should be assigned only to walls.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace